[
{"rating": "50", "noQuotes": "\"Almost Perfect\"", "partial_entry": "Lets start with what we consider the cons....No hot jacuzzi in the main pool area.....also no heated pool (water is to cold this time of year)......Nightly entertainment needs to be established....not much to do but eat and drink. The pros......everything else. World Class..resort...employees...food....staff...ambiance...beach....facilities....rooms...cleanliness....safety....scenery....you get the idea....this resort is fabulous. It is better than any A I that we have ever been to. Good for ages 21 to 80 (if your in reasonable health) Large beautiful property. Every meal is an upside surprise. Not buffet style but sit down and be served. Enjoy.................."},
{"rating": "40", "noQuotes": "Paradisus La Perla very good but with Melia quirks", "partial_entry": "The hotel is finnished (just) but there is a lot of snagging going on although any guest disruption is minimal , Some rooms seem still unfinnished but as a newly opened hotel I guess thats the norm and definitely guests are not staying in them . Its a pity that they didnt finnish the access road though as about 100 yards remains unpaved .We started in the basic junior suite which is large , airy and very nicely decorated in a modern style with large flat screen TV and DVD/iphone player . Whilst the bathroom opens with a sliding door into the bedroom at least the toilet is seperate but if you want to see to wash your hands at night afterwards it might mean waking up the occupant of the bed .\nThis is similar to other paradisus properties and I dont understand the concept of watching the TV from the bath or watching someone else in the bath .\nWe also used our room credit to upgrade to a 1 bedroom master suite for some of our stay , similar layout of bathroom but a seperate shower room with hand basin and toilet ( but with a glass door ( why ? ) partially frosted . Two large TVs and large balcony with hot tub .\nIts difficult to assess how busy the restaurants will be as the hotel is less than 50% occupied at the moment but so far the service is second to none and the food of the highest quality .\nThe pools are large with lots of sunbeds and covered areas .\nStaff are very friendly and helpful but it does get a bit tiring having the server inroduce themselves all the time . All seem to speak reasonable english .\nBe aware that there are sales reps for Melia club time share lurking around the hotel who may not necessarily introduce themselves as such .\nA well equiped gym is available as well as a spa .\nLocal golf course 5 minutes away and with free pickup definitely worth a visit .\nOverall another excellent Paradisus/Melia hotel , probably the best we have stayed in so far ."},
{"rating": "50", "noQuotes": "wonderful Luxury all inclusive in Playa del Carmen!", "partial_entry": "I have being to many upscale all inclusives in Mexico and the caribean and this is one of the best all inclusives, great atmosphere, 1st class service, to be on a new resort the staff is just ready to serve you at any moment. the food and gastronomy was just fantastic! love the beach has a feeling of a exotic beach with no crowds (hard to find in the Playa del carmen area) my wife loved the swimup suite we had, and our butler was fantastic, so nice that they unpack your things! our favorite place was the gabi beach at night great fun and music! we are ready to come back in March! thanks for a wonderful and realxing vacation! a bit expensive but is worth every dollar, dont forget to ask for the Mango Martini!"},
{"rating": "40", "noQuotes": "Many of the rooms have no sun... But they are large, modern and clean", "partial_entry": "We recently stayed at this resort and were disappointed to have a room that had no sun on the balcony at any time of the day. It is worth getting a sea view because this will get you a a sunny aspect. Desk staff we're unwilling to offer a room change which was somewhat surprising as the hotel was at least half empty. Passion restaurant as good any paid meal. Paradisus is preserving with the concept of being able to watch tv whilst on the toilet, open plan bathroooms work for some, junior suite has errrr layout than standard room, worth upgrading."},
{"rating": "50", "noQuotes": "Most phenomenal breathtaking resort of my life", "partial_entry": "I have attempted to submit two reviews on here while at the resort. My review was so long it kicked me off twice.\n\nYou must come here, it is beyond amazing. Food, service, architecture, interior design, personalized attention, clean, relaxing. JUST AMAZING.\n\nI will come back to write a review again, Im sitting on my ocean front balcony now. But I cant wait to lay in the pool palapa and read my book.\n\nNUMBER ONE TIP. if possible get Royal Service, if at all within your budget... just do it...\n\nYou will not regret your stay here..... impossible..."},
{"rating": "50", "noQuotes": "Paradisus La Perla was truly Paradise!!!!!", "partial_entry": "Just got back last evening and had to tell everyone and anyone to go visit this truly remarkable resort. Went with my husband and daughter and had a swim-up-suite in the Royal Service Section. I have never had such superb service and the most accomodating personell at any resort I have ever been to. The mexican people truly know how to make someone feel special and pampered. The only thing I ever saw were smiles and everyone was there to make our stay memorable. This was not any easy task considering my husband is blind and confined to a wheelchair but somehow every single person at the resort accomplished it with a smile and and a wonderful attitude. Thanks to Anulfo, Guilman, Everette and so many more wonderful staff members who I have not named. The food was not like any all - inclusive you have ever been to. The hotel was exsqusite and pristine. The water and beach beautiful and clean. Thanks to everyone at La Perla for making this such a memorable vacation. I will be back soon.\n\nMrs. Elizabeth Mercado, Tampa,Florida\n\nI would like to also thank Lomas Limo company for being so wonderful too!!!!"},
{"rating": "50", "noQuotes": "Pack Your Bags and Go Today!", "partial_entry": "A gourmet tour of the world's best food. Setting a new standard for all-inclusive resorts. I'm here now. It's perfect. I wouldn't change a thing, and I'm in the hospitality business. Bring something to wear to breakfast and dinner, and a swimsuit. Reserve quickly before everyone else finds out about the gourmet restaurants, wonderful service and outstanding staff. Plenty of palapas when you've had too much sun. Worth twice the price...great place to relax. The decor is outstanding."},
{"rating": "40", "noQuotes": "Some suggestions", "partial_entry": "We are at the hotel right now. Wonderful building, may be the best one we have ever been in. Room is great, view is very good. Beach is great but it is a little walk from the hotel. There are no places to change at the beach and bathrooms or showers. This absolutely need to change. Food is good, very good. Service needs a little work, but considering that they are just opened, it should get better."},
{"rating": "50", "noQuotes": "Great deal! Modern new hotel!", "partial_entry": "Just a few lines to share with everybody! The incredible experience wee both had, my wife and I at the new hotel Paradisus Playa del Carmen, La Perla! We arrive on Wednesday the 16th of November and stayed 4 nights. Even if the hotel was recently open we were amazed by the facilities of the resort. Top restaurants, very comfortable rooms and lovely areas. Above all, I have to congratulate and thank all the wonderful hotel staff and Management for making our holiday unique. We will definitely come back and recommend this resort. Thank You!"},
{"rating": "50", "noQuotes": "Paradisus Playa del Carmen - La Perla (Adults Only)", "partial_entry": "Fabulous resort. The rooms are spectacular and the attention to detail is throughout the property. This wasn't the best beach, you have to cross through a mangrove area. It does offer chaise lounges and sand volleyball on the beach. The rest of property made up for the beach. Variety of restaurants was very good and the food was great. This is a top of the line luxury resort. Once you step into the entrance, you will see what I mean. The lobby was gorgeous and has unique seating for relaxing while you check in. It was a bit difficult to navigate because the resort is large with the center area open to Esmeralda, the family side. In this center area you will find the restaurants and bars. Once you understand the layout, it became easier. No adult only restaurants from what I remember. It was brand new when we stayed there so there weren't many guests at that time. The prices in the gift shop were reasonable and comparable to town. I stayed here for 2 nights as a travel agent touring the brand new resort. It took 2 years to build this property so everything is brand new."},
{"rating": "50", "noQuotes": "Resort Maravilloso", "partial_entry": "Gracias por darnos esa semana inolvidable..........todo fue perfecto un trato maravilloso de reyes,siempre con una gran sonrisa y Nunca dan un NO por respuesta buscan la forma de hacerte feliz, en cuanto a facilidades impresionante , habitacion con entrada privada a la piscina , Restaurantes y bares exellenete , relamente lo recomendamos............esperenmos que regresaremos,"},
{"rating": "50", "noQuotes": "unforgettable experience!", "partial_entry": "i highly recommend this wonderful and outstanding new resort.\nmy family and i had a great experience, thanks to all the well trained employees, always helping you. staff is very friendly and educated.\nabove all, restaurants are excellent, you can taste a different experience every night, from mediterranean cuisine till a sublime oriental fusion, but in just one week you can't try all of them, so you have to stay minimum 8/10 days.\nrooms are large and comfortable, pools and beach very clean.\neverybody should try spa treatments, very relaxing!\nthanks paradisus, amazing job!"},
{"rating": "30", "noQuotes": "Cautiously Optimistic", "partial_entry": "I surprised my husband with a trip to paradisus la perla from 11/17-11/21. I had read reviews on other paradisus locations and even though i was a bit nervous, i decided to take the risk of booking this resort only 2 days after it had officially opened given all the good reviews on the other resorts\n\nLets start with all the good stuff\n\n1. The staff was wonderful- everyone went out of their way to make us feel welcome. Its seems everywhere we turned, there was a drink placed in our hands\n\n2. I assume because we were one of the few couples booked, we were upgraded at check-in to the Royal services and were appointment a butler (although exaclty what we were supposed to have him do for us, i wasn't too sure)\n\n3. The grounds although still under heavy construction (see the negatives below) had great potential and the parts that were near complete were beautiful\n\nNow here are the many negatives\n\n1. There was waaaay too much construction still going on. there were workers everywhere- they trudged mud/dirt through the so called finished areas, places were dusty and overall the place looked unfinished which is was. When u entered the compound, you encountered La esmeralda (family friendly side of the resort) which was still obviously under construction and even the front area of la perla wasnn't complete\n\n2. The food and drinks were far below what i expected. All the mixed drinks tasted the same whether u got a daquiri or some other mixed drink- they were just different colors it seemed. The food was mediocre and we ended up eating essentially the same thing for lunch/dinner almost every night we were there. the breakfast buffet i will admit was pretty good.\n\n3. We thought we had a $350 coupon that could be used for upgrade, spa services and food upgrades. besides the explanation we got for the breakdown of how to use the coupons for the spa, nothing was said about food so imaging our surprise when we upgraded our wine at dinner the last night and at check out were told we could only apply $20 to the upgrade ($44/glass) rather than the $100 we thought we had. Needless to say, i fought this tooth and nail and they finally gave in after 45 min at the desk trying to check out\n\n4. there were many mosquitos- we had to ask for our room to get sprayed nightly and even then, my husband came home with over 15 mosquito bites\n\n5. The entertainment was horrible. Considering how isolated the resort was, we though at least there would be good entertainment at night. One night we had a group of 3 belly dancers who danced for maybe 2 hrs on and off, another night was a DJ who by 10 P or so was shutting down- my husband and i would just got our room early and watch tv/read a book\n\n6. The hotel very poorly advertised their location. We went to 5th avenue and had to give the taxi driver directions to the hotel (did i say this was our first time in mexico?) The signs pointing to the actual open entrance was very poor so even when we 'saw' the resort, it would take us an additional 5-10 min to get to the entrance\n\n7. the beach was just OK- the hotel was located in a poor city and the locals seemed able to access the beach as they wanted to you questioned the safety of it and it wasn't the cleanest beach.\n\nSo as you can see, the negatives kind of outweigh the positives. I am trying to give them the benefit of the doubt and saying things were as they were because they had just opened but i still wonder. Maybe we'll visit again someday and hopefully they would have things together then."},
{"rating": "50", "noQuotes": "Nice resort but not completed", "partial_entry": "Again, just returned from the PLP and was quite impressed with this resort and the quality of the bars and restaurants. The rooms are spacious and as expected with a new resort, there is a nice smell to it and specially in the bars.\nHowever this resort is not quite ready to show it's full potential, there is still lot of workers around (more that customers) but once it has been opened for a few months and all the grounds are completed it will be a #1 resort. Would definetly returned and stay in a swim up suite."},
{"rating": "50", "noQuotes": "Will Return", "partial_entry": "I found this resort perfect!! The people who wrote anything negative are far too picky.The staff was very attentive,and helpful.There is a little construcstion,but nothing major.This resort is so perfect you never have to leave.The downtown area is only a few minutes away by cab.I will return and I will tell everyone you can expect a luxury,relaxing,enjoyable time.This place was truly paradise!"},
{"rating": "50", "noQuotes": "An absolutely perfect spot - for a new hotel they have executed amazingly well with service, food and amenities.", "partial_entry": "I'm on day three of my stay here and had to share my experience to date. All of the staff are fantastic, very friendly and exceptionally well trained. The resort itself is beautiful and the stock photos don't even do it justice. But the food is the biggest surprise - world class from the edamame and burgers up to lamb, sashimi and halibut. Nothing has been less than perfection. I suggest you get here soon because once the word gets out you won't be able to get near this place. In a word - perfection!"},
{"rating": "40", "noQuotes": "Best all-inclusive resort in Cancun/Riveria Maya", "partial_entry": "We visited Paradisus La Perla in Play del Carmen the week of November 28th, 2011. This was just shortly after it had opened and as such it was not 100% open. The family side of the resort, La Esmeralda, was net yet open and several of the restaurants were not yet open. Despite this, we were amazed at how great this resort was and can’t wait to return when it is fully opened. This was our fourth time visiting Cancun/Mexican Riveria and our first time at a Paradisus resort. We have previously stayed at resorts by Excellence and Secrets.\n\nNegative Reviews:\nFirst I want to respond to some of the other negative reviews and give you my point of view. While no resort is perfect (I highlight the negatives I felt throughout my review below) I feel that some people expert perfection and over exaggerate problems they see.\n\nConstruction: Yes, there is construction going on. This resort had only be opened two weeks and the other side of the resort was still under construction and had not yet been opened. I am not sure what people expected going to a resort under these circumstances. We knew this going in and expected this. While occasionally we saw construction going on, the vast majority of it was in areas that were outside of where we were. This never bothered of affected us while at the pool, beach, dining, etc. (We never experienced any sort of power loss) The noise was not bothersome and I never noticed the dust that others complained about. I suspect that within a few months this will be a non-issue, but I would still visit even now considering the great discounts they are offering.\n\nMosquitoes:\nI see this complaint with every beachfront ocean resort I have ever seen. This amazes me, as these people must live in an area that has no mosquitoes. We have been to many beachfront resorts throughout the world and I have yet to be to one that did not have any mosquitoes. Yes, we did see mosquitoes but they never bothered us while at the pool, beach, dining, relaxing in the evening outside or in our bedroom. They were never numerous enough to have to resort to using repellant.\n\nLocation:\nThe resort is right in the heart of Playa del Carmen. We took a private transfer via Lomas and it took about 45 minutes from the airport. They are still doing construction on the entrance streets and you have to wind through downtown Playa del Carmen to get to the resort. Obviously you will see some of the poorer sections of this small fishing village/tourist town, but we always felt safe on the resort. The location is also great if you want to go downtown during your visit for shopping or to the large selection of nightclubs, as these are only minutes away by taxi. The resort is made up of two resorts: La Perla which is adults only and La Esmeralda which is for families. They both are separate resorts that share the same restaurant, spa and lounge area in the middle. La Esmeralda was not yet open when we were there, but they were just finishing it up and it looked awesome for families. It offesr a large kids pool area with pirate ship and water play features. It was also nice to see that some restaurants were adults only and most of the others only allowed adults after 9pm… so if you stay at La Perla you will likely feel you are in an adults only area with its separate pools, etc.\n\nThe Beach:\nThe resort sits on one of the nicest beaches in Playa del Carmen. The sand is soft, clean white sand and the water is warm and clear. It is not a huge beach, but is still nice and I liked the fact that it was very private and not crowded as compared to the beaches on the main strip in Cancun. The resort sits back about 100 yards from the actual beach and you have to take a boardwalk type path to the beach through the mangroves. Since it was newly opened there was only one path from the resort to the beach, but they were working on two more so it should have several very easily accessible paths to the beach in a few weeks. At the beach they had life guards and several staff to help you get setup, bring you drinks and food, etc. They had nice loungers, umbrellas, small tables and plenty of towels available. They did not yet have any of the small thatched palapas/wooden umbrellas structures yet, but again it was just opened and these should be there in the future. This resort is not the ideal resort if the beach is the most important feature you are looking for. There are much nicer beaches at other resorts (Secrets Maroma Beach for example). The beach is small, separated from the resort by mangrove trees and did not offer any water sports when we were there. If you just want to be able to go to the beach for a little while to enjoy the ocean, but plan to spend the majority of your time around the pool then you will still like it as we did.\n\nThe Pools:\nThere are basically two large pools (a main pool and a private Royal Service pool) and then a long series of swim-up room pools in front of all of the ground floor rooms. Every ground floor room was a swim-up room that had a series of steps in to the pool and a tiled 2-person lounger built in the water (these were very cool and great for laying out in the sun). The pools have a lot of lounge chairs as well as thatched covered palapas with day beds. If you like hanging around the pool in a daybed, then this is the best resort as they have a ton of them here, more than we have ever seen at any other resort. The pools also have a small but nice swim-up bar and there are always plenty of staff walking around offering you food or drink. We found the pool areas at this resort had a focus on providing you with lots of areas to relax and feel some privacy while still enjoying the pool as compared to other resorts that have larger central pools with lots of people crowded around one spot. If you want the “party” type pool with a large swim-up bar and area to hang out with lots of people, then this is probably not the best for that. The pools here focus on lots of smaller private areas around the pool than just one big public area. One drawback is you can’t see the ocean from the pool areas like you can at other resorts. We really enjoyed the Royal Service pool. It was smaller, more private and had lots of tiled two-person lounge chairs built in the pool (I have never seen these at other resorts and they are awesome!). It also had its own pool bar. The Royal Service pool would be ideal if you were at the resort during a peak crowd time. We also really enjoyed the modern lounge style music playing throughout the pool area. This is the kind of music you would here at a Vegas style ultralounge. It was very upbeat yet relaxing.\n\nRooms:\nWe stayed in a Luxury Junior Suite Ocean View. First, all of the suites that are on the upper floors are “ocean view” and all of the ground floor suites are swim-out. Because of the resorts location you can’t see the ocean from the ground floor swim-out suites. So if you want a view of the ocean you will need to get an upper floor room. Most of the rooms sit pretty far back from the ocean so your “ocean view” is not great, especially if you are on the second floor. You really need a room on the 3rd or 4th floor if you want any sort of view. The only rooms that have a decent view are the ones in the two buildings that face the ocean and are closest to the ocean.\n\nThe rooms are exactly as pictured on the website. The have a very modern, chic upscale Vegas style feel. (Actually this is nicer than any room we have ever stayed at in Vegas) The bed is very comfortable, but the mattress is rather firm (hopefully this is the type you like). It has a nice flat screen TV with several US channels. It also has a cool button in the bathroom so you can hear the TV in the bathroom area. It has a great iPod/iPhone docking station with speakers that sounds great and is ideal for bringing you own music to listen to in the room. Our room had a coffee maker and a really cool espresso type maker that uses the individual pods. (like a Tassimo or Keurig type coffee maker). This was awesome and made great coffee every morning. There was a mini bar with some chips and M&Ms, as well as stocked with lots of bottled water, sodas and beer. There are two closets and plenty of drawers offerings lots of rooms for you clothes. I also liked the fact that the toilet was in its own separate area with a door at the very opposite end of the room (at the entrance)…giving you lots of privacy if this is important to you. The bathroom area has a huge, blue neon lit, 2 person tub, two sinks and lots of shelves to store your stuff. The only complaint here is that there is very little sink space to put your stuff on when getting ready. The shower is an awesome large two-person shower with each end having its own rain shower. The bathroom also has a great design where it has sliding walls which allow you to either close it off for complete privacy or open it up so you can enjoy the room/view from your tub. Our room had a large balcony with two chairs and a second outdoor 2 person Jacuzzi tub.\n\nWe had booked a “regular” Luxury Junior Suite Ocean View, which is there basic suite, but when we arrived we were offered to upgrade our room to a Royal Service room for a few hundred dollars more so we decided to upgrade to the Royal Service room. Online it was considerably more expensive to book the Royal Service rooms and thus we decided not to book it then, but likely since the resort was just opened and well below capacity, I think they gave us a very good deal to upgrade. There were a few of things that we really liked about the Royal Service. First, the Royal Service has the best views so if you want an ocean front view you should book this. The mini bar included a 375ml bottle of Tequila, Jack Daniels and Absolut Vodka. You have your own private check-in/out area which would be great if you were checking in during peak season. There is a really nice private lounge area were they offer drinks and awesome hors d'oeuvres through out the day. The Royal Service had its own pool area that was the nicest one. It was closest to the beach, had an infinity pool and a ton of those 2 person loungers built in the pool that we loved. The Royal Service also had it own open air restaurant called La Palapa. We really loved this place for breakfast and lunch. While all of the restaurants were awesome, I think this place would especially be a great treat if the resort was crowded as it would offer a nice place to eat and get away form the large crowds. The Royal Service also includes your own personal “butler”. Our butlers name was Edwin and he was awesome. He would check-in with you throughout the day and take care of any request: making reservations for dinner (again important if you were staying during peak bus season), getting you a newspaper, taking care of any problems, etc. The service here was just incredible. They were constantly looking to take care of any need you might have. I think the concept of “butler service” here is a little exaggerated and unnecessary, but the level of service is definitely the best we have every experienced. For example: One day there was no music playing around the Royal Service pool and they ended up bringing down and setting up one of the iPod/iPhone speaker docks so we could listen to our own music. In the end I don’t think we would pay substantially more for a Royal Service room, but if offered for a few hundred dollars more we would definitely do it again.\n\nWi-Fi\nThere is free internet access via Wi-Fi throughout the resort, but the coverage isn’t very good. We were not able to get it in our room nor could we get it around the Royal Service pool area (this should be fixed!). But we could get it in the Royal Service lounge area, around the main pool and around the hotel lobby and restaurants. The Royal Service lounge also offered computers with internet access.\n\nDining\nThis resort offer the best dining by far compared to all of the other all-inclusive resorts we have stayed at. The food is fantastic. We met Tomas, the Food and Beverage Director over all of the resorts, while there and you could really see that they are focused on offering high quality gourmet food at all of their restaurants. All of the restaurants have modest menus with a variety of unique vegetarian, meat and seafood items. Everything comes out fresh having just been made specifically for you… never do you feel like you are eating some sort of large scale institutional type of meal like at a typical hotel or cruise. Now this can be a draw back for some as they tend to appeal to “foody” type of people who like varied, different and gourmet style food. If you prefer just standard American cuisine on the lines of Applebees, Olive Garden, Red Lobster, etc then you will likely be disappointed. They do have great steaks, burgers with french fries, club sandwiches, pizza, chicken wings etc… but most of their offerings tend to be more gourmet than standard cuisine. Only half of the restaurants were open when we were there, but the rest were opening the week after we left. Here is where we ate:\n\nLa Palapa: This is the open air restaurant just for Royal Service guests. We ate here for breakfast and lunch several times. They had the most incredible croissants we have ever had. They also make a great burger.\n\nPassions: A romantic restaurant with very unique, gourmet style food. We had wild boar, white bean and scallop soup, and a lobster ravioli to name a few. We also had a phenomenal bottle of Mexican Cab/Merlot wine called Unico. Iran, their wine sommelier, was great. If you like wine, ask for him as he can help give you background on a lot of unique wines and help you find a something new like he did for us.\n\nBana: We ate here two nights. They offer a variety of Asian food. One night we had their Tapenyaki style dinner where you sit around a central grill and the chef makes you meal in front of you (think Benihanas). The food and appetizers were great. The second time we ate at their sushi bar. You are probably thinking “sushi in Mexico?” but it was some of the best we have ever had anywhere. Their sushi chef lived in Japan for many years and is married to a Japanese woman. They raise their children only speaking Japanese when in their home… so this guy is the real deal. They only offered a modest selection of sushi rolls, but when we asked if he could make something different using octopus he said “no problem” and created one of the best sushi rolls we have ever had. They also have a fantastic spicy tuna roll that has jalapeño peppers… I couldn’t get enough of this and still am craving them as I type this.\n\nThe Grill: This is an open air restaurant offering steaks, pizza and seafood. The steaks were very good. I had their rib eye, that while thin, was large, tender and very flavorful. While not the best steak I have ever had, it was far better than any one I have had at any other all inclusive resorts… typically all-inclusive resorts tend to go cheap on the steaks. They also offered larger abd better cuts of steaks (cowboy bone-in ribeye, Porthouse, etc) that you could purchase for just a few dollars extra. Some people may complain feeling everything at an all-inclusive should be included… but if it was then you would not even have an option for these more expensive steaks. I would have paid the extra $ if I really wanted a larger and better steak and probably would of if we stayed longer, but I found their ribeye was great. The sides (we had mashed potatoes and corn) were “ok”, but they tasted as though they had been made much early and were not very hot when served. They also had a nice salad bar, but the selection was somewhat limited when compared to a typical salad bar in the US. Their pizzas were very good but expect more of a gourmet flat bread style and not a New York style pizza. We sat at an outside table, next to a fountain with the stars overhead… very romantic.\n\nHadar: We ate here for breakfast one day. They have a large breakfast buffet with all kinds of food. From Mexican, European and American style breakfast food. They have a custom omelet/egg station where they will make your eggs to order… I had probably the most perfectly cooked sunny side up eggs here I have ever had… they looked liked something from a cookbook. They also have a custom pancake/French toast station. I loved their link sausage as it had a slight Mexican style taste to it… almost like a chorizo style sausage. Again… they have the best croissants here I have ever had.\n\nNightlife\nBeing that the resort had just been opened a few weeks and didn’t have a lot of people staying there yet, the night life was somewhat limited… but promising. They had several shows while we were there that were very good. One night they had fire dancers that were way better than I expected… very cool show. They have several bars/lounges that are really nice… on the lines of a Vegas style ultralounge. The Gabi Club is a outdoor lounge with variety tables, chairs and daybeds set outdoors in the sand with very cool lighting. A great place to chill. The South Avenue Bar was open air and kind of in the middle of the resort. They had a DJ playing dance club style music at night and one night had professional dancers dancing. It has lots of tables and couches throughout. While they did have a DJ playing great music, they did not really have any designated place to dance… this would have been a great spot to dance if it was setup for it. The coolest bar was the Red Lounge. This really felt like a Vegas type nightclub. It had a very modern, chic décor with lots of little areas to hangout and a large red bar. They had a lot of very good unique drinks. The also had a great dance floor… the one problem was they didn’t have any dancing or DJ. It was setup with a DJ booth and you could see that this place was designed to be their nightclub for dancing and I suspect that once the resort is fully opened and starts to get crowded that this will be the place for dancing. At this point if you really want to go out clubbing/dancing your best bet would be to check out PlayaCrawl.com where you can get an escorted night out at all of the local nightclubs in Playa del Carmen. Hopefully in the near future you won’t need to leave the resort to dance.\n\nYhi Spa\nThe Yhi spa is a very nice modern spa. While a very nice spa, it is not as nice as ones we have found at other resorts. If one of the main focus’ of your vacation is the spa then I think I would stay at another resort that has a nicer spa (Excellence Playa Mujeres for example) It is offers a great full service salon for hair, makeup, manicure, pedicure, etc type services… great if you are planning to get married here. They also have really nice massage rooms… both for couples and individual massages. The massage rooms also have these really cool open air outside showers in each room. The men’s and women’s locker rooms are nice offering lockers, changing rooms, showers and steam and sauna rooms. The steam and sauna rooms are separate for men and women… nice if you want privacy, but not so nice if you want to enjoy them with your spouse, etc. We had a couples massage which was great… the best my wife said she had ever had. They also had a water circuit area, but it was very small, not a lot of features and was pretty cold when we were their… this was disappointing when compared to other spas we have been to that offered similar treatments. The biggest negative here was their prices. They were very expensive when compared to most others we had been to. For example, their standard deep tissue massage was almost $200 for 50 minutes. In our opinion their prices should have been about half for what they offered.\n\nOverall Impression:\nOn a scale of 1-5, we would give this resort a 4.5, hoping that by the next time we come everything will be fully open and worthy of a 5. The negatives: ok beach, modest beach views, expensive spa, limited wi-fi, small bathroom sink areas, and no dancing yet in the Red Lounge. The positives: awesome rooms, fantastic food, great service, lots of great lounges, nice pool areas with lots of places to relax, and good entertainment. So far, this is our favorite resort in the Cancun/Riveria Maya area and we look forward to coming here again in the near future."},
{"rating": "20", "noQuotes": "not happy", "partial_entry": "A lot of construction, hotel was not ready, elevater was not working, enterances to the hotel was not finished,coupons for credits not possible to use ,spa very expensive ,you have to pay to enter the sauna very disappointment .A lot of mosqutoes in the room.In restaurants service -excellent but every day the same food .construction dust on stairs. I do not advise to go ."},
{"rating": "30", "noQuotes": "Disappointed but hopeful", "partial_entry": "We checked in on 30 November to celebrate our 25th wedding anniversary. Having been to other Paradisius properties in the past we arrived with high expectations. Our experience so far has been been mixed.\n\nBefore I share the sources of disappointment I want to start with positives: 1) the architecture and design throughout this property is first rate; 2) the service given by staff in restaurants, bars, etc. is consistently very good to excellent.\n\nNow for some of the bummers:\n1. There is still a lot of construction happening here. Electricians, carpenters, landscapers, etc. are everywhere.\n\n2. The entances to the property are far from finished. You'll basically enter via some dicey back streets of Playa del Carmen and then a construction entrance.\n\n3. No wi-fi in the guest rooms. Crazy!\n\n4. The $350 resort credit is actually a bunch of discount coupons like $40 off a $200 massage, $10 off a $100 bottle of wine, etc. I really felt we had been given a bait and switch on this deal. Super disappointment.\n\n5. The restaurants and bars have wonderful atmosphere and really interesting theme menus but the food -- and many of the bar drinks -- are just bland. These places are meant to deliver a really memorable experience but they are struggling with execution. The service and presentation is excellent but the final products disappoint.\n\n6. Upon arrival in our room we found the tables and floors to be heavy with construction dust. A shower drain was clogged. Later in the evening our electricity went out. For 30 minutes we had people walking in an out trying to restore power -- this was during a romantic evening with my wife. I called the front desk and asked for a new room but was told none were available - even though the hotel has very few guests. As I pushed for satisfaction - I insisted we be moved and upgraded to the Royal Service section. I was told that they were running a \"business\" and this would not be possible but perhaps tomorrow I coould be given an opportunity to upgrade at 50% discount. Despite my best effort we still have same room even though the occupany is very low.\n\nWe have 2 more nights here so I will submit an update at end of our trip."},
{"rating": "50", "noQuotes": "Can't wait to go back", "partial_entry": "My wife and I just spent Thanksgiving at this new resort and were very pleased we choose Paradisus La Perla. From the moment we arrived we were treated with A+ service. Our accommodations were beautiful (we selected a Jr. Swimup Suite). The room was very modern and mirrored the pictures posted on their website unlike many properties I've previously visited. The best inroom feature not posted on the website was the dual couples shower, it's always nice to not have to wait on the shower.\n\nAll the restaurants offered great decor and even better food. My wife and I were celebrating our anniversary and we received special surprises at every meal. The staff was top notch and were eager to cater to any and every request, but the pool staff was especially pleasant as this is where we spent the bulk of our time. They keep the drinks coming and offered a lot of insight about things to do while in Playa Del Carmen. Each day they offered classes from water aerobics to bartending; all of which my wife took full advantage of.\n\nThe only complaint I had was the sun played peek a boo the entire week and the brisk breeze made swimming more like participating in a polar bear club than taking a refreshing dip. When that's all you can complain about you can't put that on the hotel. I would definitely reccommend La Perla to anyone planning a trip to Playa. I will definitely be back; just in the summer months next time!!"},
{"rating": "50", "noQuotes": "Excellent romantic getaway!", "partial_entry": "Paradisus La Perla is a brand new modern and sophisticated resort. My wife and I went on vacation there and we had a great time. Besides all the excellent infrastructure the hotel provides, the hospitality from the employees was something that stood out. It seemed like they would do everything they could to make us feel welcome. The beach there is absolutely amazing with its turquoise waters. There is a natural mangrove reserve in front of the beach so it feels like there is nature everywhere. Whenever we felt like we wanted to do something, there was beach volleyball, dancing lessons, tennis and other interesting attractions that happened every hour. The room is fashionably decorated and has a huge tub. Must say that was a pleasant plus. If I would have to point out something negative, I would have to say that I might have gained a couple of pounds, because the food was so good, that eating also became an event! Overall I strongly recommend it."},
{"rating": "50", "noQuotes": "Pure Indulgence ! Yours to Discover and Come Back for More!", "partial_entry": "Having spent two unforgettable weeks at the newest resort in Playa del Carmen, I need to admit that we need to share plenty highlights of this new Paradisus! Arrive at this glamorous main hall: ‘eco hall’ and feel the rhythms of your heart ready to enjoy a new experience and be taken some place fabulous. The location where the resort was built is absolutely breathtaking… a virgin bay, turquoise water, the finest sand and a magnificent view of Cozumel.. a mangrove right in front of the complex … need no more to feel just right! Total relaxation! Enjoy life enriching activities: such as tequila tasting, sushi making, photo lab workshop…. Take some dance lessons or just relax at the pool - swirl yourself towards the sun and make sure you tan from sunrise to sunset-close the bar… thanks to the moving lounge beds! Wake up and … do not miss HADDAR! OMG!.. if you love breakfast like me .. you will fall in love with their pastries, bakery, yogurt shots, natural juices, walnuts.. and even sin with some Mexican morning choices like chilaquiles, mole pueblano!! Indulge!… I love the signature croissant by The Glorious Hands of Juan de la Cruz….. Mmmmmm! Will come back just for them!And this is just the beginning of a climax of gastronomic indulgences. An at night… let the magic of their characters enchant you . … let them seduce you and take you from Rock to Opera..from Jazz to Lounge… You choose where you hang out.. If your destination is the Mayan Riviera…… Paradisus Playa del Carmen, La Perla just for adults will become your second home. Go and Experience on your own!"},
{"rating": "40", "noQuotes": "Paradise only begins to capture this resort", "partial_entry": "The only reason I was not able to give 5 stars is because there were still areas of the resort that were not yet completed. This will be a world class resort destination once fully complete, and at occupant capacity.\n\nThe resort staff is as courtious and helpful as I have ever been around. They are all ready to make every hour you spend here as relaxing as possible. Sitting by the pool in the personal straw huts was the most peacful experience you could ever imagine. Today we will be going on our trip to Xcaret, recommended by almost all the staff.\n\nThe restaurants are amazing. There is something for everyone, from fine dinner dinning in Feugo, to the relaxing poolside cuisine at Sunrise. All around the staff is ready to engage in conversation or provide the occasional spanish lesson. It was very obvious they love what they do and take a lot of pride in this resort. The staff is truely the heart of this paradise.\n\nI would highly recommend this resort to anyone intending on travel to Playa Del Carmen."},
{"rating": "50", "noQuotes": "Luxury at its Finest", "partial_entry": "We just got back from 4 days in paradise. The name Paradisus is appropriate for this amazing property, it means paradise in Spanish. From the great and friendly staff, terrific facilities and world class dining this place has it all. The beach is also world class. We enjoyed daily beach volleyball, the spa, salsa dance classes, sushi making classes , photography lessons, and endless water sports. The place is the real deal and I highly recommend it for people looking to relax, love great food (foodies) and want a beach and/or romantic environment,"},
{"rating": "50", "noQuotes": "Site Inspection", "partial_entry": "The location of resort is excellent, situated off of 5th Ave in Playa Del Carmen. Close to shopping, restaurants, and clubs in area. Approaching the resort, still some minor construction going on with the entrance way. They are finishing a brick road. After talking to manager, he assured me that all construction would be complete within a months’ time. There are two sides to the resort, Esmeralda and La Perla. Esmeralda is the family side and La Perla is adults only side. They do have a common area situated in middle. Adults who stay at Esmeralda do have access to La Perla and vice a versa. Once walking into the lobby, the first thing you notice is how modern everything is, upscale and very nice. The décor alone will set the mood for entire trip, definitely a five star luxurious feeling. Employees are very welcoming and polite and you get the sense they will go out of their way to help you. All rooms are suites that offer garden and pool view rooms, as well as swim-up suites. The pool is very large and is surrounded in lounge chairs with towels on every chair for convenience. The resort is still working on building more pathways down to the beach. It is set 30 yards from ocean with trees and plantation in between. Don’t really see the ocean from resort, but it’s a short two minute walk if that. The Japanese restaurant was not yet opened but will be within a months’ time. Overall, I was very impressed with the resort and it is a top choice for romantic getaways and having that prestige five star factor, from the lobby, the restaurants, the rooms, and the amenities of resort. It does lack in entertainment. No nightly shows or disco on site. But again, nightly entertainment is but a three minute cab ride in downtown Playa Del Carmen."}
]